# Datos faltantes

En pandas, los datos faltantes se representan como NaN (Not a Number), y son un valor propio de Numpy, correspondiente a np.nan.

En el dia a dia casi SIEMPRE encontramos datos faltantes, por eso es muy importante saber como tratarlo, debido a que cuando entrenemos ciertos modelos de machine learning, la presencia de datos vacios no es aceptada.

Veamos algunos metodos para lidiar con ellos cuando se nos presenten

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [3]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

#### dropna()

Metodo para eliminar filas y/o columnas que contengan valores nulos.

Nos devuelve el df con sin los elementos que se eliminaron.

In [12]:
# metodo para eliminar todas las filas que tengan algun valor NaN
df.dropna()

     A    B  C
0  1.0  5.0  1

In [13]:
# lo mismo para las columnas
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [ ]:
# por defecto el metodo dropna, va a eliminar la fila o columna que tenga al menos un valor Nan
# esto puede cambiarse

In [4]:
df.dropna(how='all')

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [19]:
# thresh indica la cantidad minima de valores no nulos requerida para conservar la fila o culumna
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

#### isna() y notna()

Metodos para determinar si cada valor es nulo o no

In [25]:
df.isna()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [21]:
df.notna()

       A      B     C
0   True   True  True
1   True  False  True
2  False  False  True

In [23]:
# incluso podemos chequear sobre una columna
df["A"].notna()

0     True
1     True
2    False
Name: A, dtype: bool

In [27]:
# podemos sumar para contar los valores nulos que tenemos
df.isna().sum()

A    1
B    2
C    0
dtype: int64

In [ ]:
df.isna().sum().sum()

In [28]:
# podemos usar estos metodos como filtro

df["B"].isna()

0    False
1     True
2     True
Name: B, dtype: bool

In [29]:
df[df["B"].isna()]

     A   B  C
1  2.0 NaN  2
2  NaN NaN  3

#### fillna()

Metodo para rellenar valores nulos con otro valor

In [32]:
df.fillna(value='Relleno')

         A        B  C
0        1        5  1
1        2  Relleno  2
2  Relleno  Relleno  3

In [33]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [34]:
# puedo especificar la columna a rellenar
df["B"].fillna("relleno b")

0            5
1    relleno b
2    relleno b
Name: B, dtype: object

In [35]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [38]:
# puedo rellenar los nulos con el promedio de la columna

In [41]:
df.mean()

A    1.5
B    5.0
C    2.0
dtype: float64

In [42]:
df['A'].mean()

1.5

In [43]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [45]:
# mean() no tiene en cuenta los valores nulos para sacar el promedio
df.mean(axis=1)

0    2.333333
1    2.000000
2    3.000000
dtype: float64